Tutorials-3.0.1/movingMesh/ERCOFTAC-compressor/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pisoCentralDyMFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.3; //T=0.426

deltaT          1e-6;

writeControl    adjustableRunTime; //timeStep

writeInterval   2.0e-4;

cycleWrite      0;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression compressed;

timeFormat      general;

timePrecision   7;

runTimeModifiable true;

adjustTimeStep  true;

maxCo           0.5;

maxDeltaT       1e-3;

CourantType	faceCourant;

functions
(
);

libs ("libOpenFOAM.so" "libcompressibleTools.so");
// ************************************************************************* //
