Tutorials-3.0.1/movingMesh/ERCOFTAC-compressor/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5-dev                               |
|   \\  /    A nd           | Revision: 1629                                  |
|    \\/     M anipulation  | Web:      http://www.OpenFOAM.org               |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    INLET
    {
	type           surfaceNormalFixedValue;
	refValue	uniform -10.0;
	value	       uniform (0 0 0);
    }

    BLADE_ROT
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);

    }
    HUB_SHROUD
    {
        type            empty;
    }
    AMI_INT
    {
        type            cyclicAMI;
        value           uniform (0 0 0);
    }
    AMI_EXT
    {
        type            cyclicAMI;
        value           uniform (0 0 0);
    }
    OUTLET
    {
	//type	flowRateInletVelocity;
	//volumetricFlowRate -0.0072401;
	//value	uniform (0 0 0); // placeholder
	type		inletOutlet;
	inletValue	uniform (0 0 0);
	value		uniform (0 0 0);
    }
    BLADE_STAT
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
